<?php
/**
 * Created by PhpStorm.
 * User: lester
 * Date: 2018/5/25 14:17
 * Desc:
 */

return [
    /**
     * 登录相关
     */
    '600' => '请勿重复登录',
    '601' => '用户名不存在',
    '602' => '当前密码错误',
    '603' => '该邮箱已被注册',
    '604' => '服务器错误，注册失败',
    '605' => '验证码错误或失效，请重新尝试',
    '606' => '已被使用，请更换',

    /**
     * 主界面 上传图片
     */
    '630' => '请选择文件或选择的文件不存在',

    /**
     * 主界面 面板
     */
    '640' => '请填写新的分组名称',
    '641' => '请先移除该分组下的好友再删除',
    '642' => '将要删除的分组不存在',
    '643' => '请刷新页面重新尝试',
    '644' => '将要修改的分组不存在',
    '645' => '操作失败，请稍后再试',

    /**
     * 查找
     */
    '660' => '搜索值不能为空',
    '670' => '已经是好友关系，请勿重复添加',
    '671' => '已经申请过了，请勿重复申请',
    '672' => '添加的联系人不存在',

    /**
     * 消息盒子操作
     */
    '680' => '你不是管理员，无法审核加群申请',
    '681' => '群状态异常，请刷新页面重新尝试',
    '682' => '请选择同意or拒绝',








];